# Дан произвольный текст. Каких символов больше, точек "." или запятых ","?
# Если точек и запятых одинаково - выведите "одинаково"

text = input("Введите текст:")

dots = text.count(".")
commas = text.count(",")

if dots == commas:
    print("Точек и запятых одинаково")
elif dots > commas:
    print("Точек больше")
else:
    print("Запятых больше")
